src/test/resources/data/soap/expected.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:getItemRequest xmlns:ns2="http://ws.io">
            <date>${exam.now-[1 y]:yyyy-MM-dd}</date>
        </ns2:getItemRequest>
    </soap:Body>
</soap:Envelope>